In [15]:
import os
import mysql.connector
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
my_db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
db = 'girrafe' 
)

In [3]:
my_db

In [4]:
data_tables = pd.read_sql_query('SHOW TABLES FROM girrafe',my_db)

In [5]:
data_tables

  Tables_in_girrafe
0            branch
1   branch_supplier
2            client
3          Employee
4      trigger_test
5         work_with

In [6]:
serie_tables = data_tables['Tables_in_girrafe']

In [7]:
for table in serie_tables:
    output = pd.read_sql_query('DESCRIBE {}'.format(table), my_db)
    print(table)
    print(output,'\n')

branch
            Field            Type Null  Key Default Extra
0       branch_id          b'int'   NO  PRI    None
1     branch_name  b'varchar(40)'  YES         None
2          mgr_id          b'int'  YES  MUL    None
3  mgr_start_date         b'date'  YES         None

branch_supplier
           Field            Type Null  Key Default Extra
0      branch_id          b'int'   NO  PRI    None
1  supplier_name  b'varchar(40)'   NO  PRI    None
2    supply_type  b'varchar(40)'  YES         None

client
         Field            Type Null  Key Default Extra
0    client_id          b'int'   NO  PRI    None
1  client_name  b'varchar(40)'  YES         None
2    branch_id          b'int'  YES  MUL    None

Employee
        Field            Type Null  Key Default Extra
0      emp_id          b'int'   NO  PRI    None
1  first_name  b'varchar(40)'  YES         None
2   last_name  b'varchar(40)'  YES         None
3  birth_date         b'date'  YES         None
4         sex   b'varchar(1)'  YES         None
5      salary          b'int'  YES         None
6    super_id          b'int'  YES  MUL    None
7   branch_id          b'int'  YES  MUL    None

trigger_test
     Field             Type Null Key Default Extra
0  message  b'varchar(100)'  YES        None

work_with
         Field    Type Null  Key Default Extra
0       emp_id  b'int'   NO  PRI    None
1    client_id  b'int'   NO  PRI    None
2  total_sales  b'int'  YES         None

In [8]:
db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225'
)

In [9]:
db

# Check Databases

# Step1

In [10]:

# Create a pointer called cursor

my_cursor = db.cursor()

In [11]:
my_cursor.execute('SHOW DATABASES')

In [12]:
for x in my_cursor:
    print(x)

('database1',)
('girrafe',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

# Step2
### how to create a __DATABASE__?

In [13]:
## After the connection

my_cursor = db.cursor()

In [ ]:
my_cursor.execute('CREATE DATABASE database1')

In [ ]:
my_cursor.execute('SHOW DATABASES')

In [ ]:
for x in my_cursor:
    print(x)

# Step3 

### How to create a __TABLE__ ?

In [16]:
# How to create table. Mention the database where you want create table inside

db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
database = 'database1'    
)

In [17]:
my_cursor = db.cursor()

In [ ]:
my_cursor.execute(
    'CREATE TABLE marks(gender VARCHAR(6), student_id INT(10),marks INT(3))')

In [18]:
my_cursor.execute('SHOW TABLES')

In [19]:
for x in my_cursor:
    print(x)

('marks',)

# Step4


### How to insert records into the table __(1)__

#### __Single__ record insertion.

In [ ]:
 sql = "INSERT INTO marks (gender,student_id,marks) VALUES('female',200,67)"

In [ ]:
my_cursor.execute(sql)
db.commit()

In [ ]:
print(my_cursor.rowcount,'record inserted')

### __Multiple__ record insertion __(2)__

In [ ]:
 sql = "INSERT INTO marks (gender,student_id,marks) VALUES('female',201,70),('male',202,65),('female',203,77),('female',204,66)"

In [ ]:
my_cursor.execute(sql)
db.commit()

In [ ]:
print(my_cursor.rowcount,'record inserted')

In [ ]:
ls

In [ ]:
today_data = pd.read_csv('sql_data.csv')

In [ ]:
today_data.head()

### __Multiple__ record insertion __(2.1)__

### Another to insert multiple records
## Using __executemany(a, b)__ take two arguments

In [ ]:
sql = "INSERT INTO marks (gender,student_id,marks) VALUES(%s, %s, %s)"
## number of columns must be equal to number %s

In [ ]:
value = (('male',205,55),('male',206,59),('male',207,80))

In [ ]:
my_cursor.executemany(sql, value)
db.commit()

In [ ]:
print(my_cursor.rowcount, 'row inserted')

In [21]:
my_cursor.execute('SELECT * FROM marks')

In [22]:
my_result = my_cursor.fetchall()

In [23]:
for x in my_result:
    print(x)

('male', 100, 50)
('female', 200, 67)
('female', 201, 70)
('male', 202, 65)
('female', 203, 77)
('female', 204, 66)
('male', 205, 55)
('male', 206, 59)
('male', 207, 80)

In [24]:
sql1 = "SELECT * FROM marks ORDER BY marks ASC"

In [25]:
my_cursor.execute(sql1)

In [42]:
resultt = my_cursor.fetchall()

In [44]:
for xx in resultt :
    print(xx)

In [31]:
command = "UPDATE marks SET marks = 100 WHERE student_id = 100"

In [32]:
my_cursor.execute(command)
db.commit()

In [45]:
print(my_cursor.rowcount,'rows affected')

1 rows affected

In [46]:
resultt = my_cursor.fetchall()

In [47]:
for x in resultt :
    print(x)

In [52]:
db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
    
)

In [53]:
my_cursor = db.cursor()

In [50]:
sql = 'DROP database database1'

In [51]:
drop = my_cursor.execute(sql)

In [54]:
my_cursor.execute('SHOW databases')

In [55]:
for x in my_cursor :
    print(x)

('girrafe',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

# Referential  integrity in __sql__
### __primary key__ and __foreign key__

### the relation is  between __parent_table__ and __chil_table__

In [56]:
my_cursor.execute('CREATE DATABASE database1')

In [62]:
db = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'Assie@225',
database = 'girrafe'    
)

In [63]:
my_cursor = db.cursor()

In [59]:
my_cursor.execute(
    'CREATE TABLE marks(gender VARCHAR(6), student_id INT(10),marks INT(3))')

In [64]:
my_cursor.execute('SHOW TABLES')

In [65]:
for x in my_cursor :
    print(x)

('branch',)
('branch_supplier',)
('client',)
('Employee',)
('trigger_test',)
('work_with',)

In [66]:
my_cursor.execute("SELECT *FROM Employee")

In [67]:
for x in my_cursor :
    print(x)

(100, 'David', 'wallace', datetime.date(1967, 11, 17), 'M', 250000, None, 1)
(101, 'Jan', 'Levison', datetime.date(1961, 5, 11), 'F', 110000, 100, 1)
(103, 'Angela', 'Martin', datetime.date(1971, 6, 25), 'F', 63000, None, 2)
(104, 'Kelly', 'Kapoor', datetime.date(1980, 2, 5), 'F', 55000, None, 2)
(105, 'Stanley', 'Hudson', datetime.date(1958, 2, 19), 'M', 69000, None, 2)
(106, 'Josh', 'Porter', datetime.date(1969, 9, 5), 'M', 78000, 100, 3)
(107, 'Andy', 'Bernard', datetime.date(1973, 7, 22), 'M', 65000, 106, 3)
(108, 'Jim', 'Halpert', datetime.date(1978, 10, 1), 'M', 71000, 106, 3)
(109, 'Oscar', 'Martinez', datetime.date(1968, 2, 19), 'M', 69000, 106, 3)
(110, 'Oliver', 'Assie', datetime.date(1997, 11, 18), 'M', 250000, 106, 3)
(111, 'Jackson', 'Brou', datetime.date(1995, 11, 11), 'M', 250000, 106, 2)
(112, 'Yao', 'One love', datetime.date(1986, 11, 11), 'M', 255000, 106, 3)
(113, 'Aya', 'One love', datetime.date(1994, 11, 11), 'F', 255000, 106, 3)
(114, 'Sanogo', 'One love', datetime.date(1999, 5, 11), 'F', 255000, 106, 2)

In [68]:
my_cursor.execute("SELECT *FROM branch")

In [69]:
for x in my_cursor :
    print(x)

(1, 'Coporate', 100, datetime.date(2006, 2, 9))
(2, 'Scanton', None, datetime.date(1992, 4, 6))
(3, 'Stamford', 106, datetime.date(1998, 2, 13))
(4, 'Buffalo', None, None)

In [70]:
sql = "SELECT branch.mgr_id, branch_name,Employee.emp_id, first_name From branch INNER JOIN Employee ON branch.mgr_id = Employee.emp_id"

In [71]:
my_cursor.execute(sql)

In [72]:
results = my_cursor.fetchall()

In [73]:
for x in results:
    print(x)

(100, 'Coporate', 100, 'David')
(106, 'Stamford', 106, 'Josh')